In [ ]:
import numpy as np
import pandas as pd

data=[
    {'ID':1,'Name':'Sahil','Age':28,'Gender':'M','Salary':30000},
    {'ID':2,'Name':'Priya','Age':-3,'Gender':'Female','Salary':50000},
    {'ID':1,'Name':'Sahil','Age':28,'Gender':'M','Salary':30000},
    {'ID':3,'Name':'Nita','Age':45,'Gender':'f','Salary':40000},
    {'ID':4,'Name':'Rahul','Age':None,'Gender':'male','Salary':60000},
    {'ID':5,'Name':'Gaurav','Age':35,'Gender':'Male','Salary':None}
]

In [ ]:
df=pd.DataFrame(data)
print(df)

   ID    Name   Age  Gender   Salary
0   1   Sahil  28.0       M  30000.0
1   2   Priya  -3.0  Female  50000.0
2   1   Sahil  28.0       M  30000.0
3   3    Nita  45.0       f  40000.0
4   4   Rahul   NaN    male  60000.0
5   5  Gaurav  35.0    Male      NaN

In [ ]:
df.isnull().sum()

ID        0
Name      0
Age       1
Gender    0
Salary    1
dtype: int64

In [ ]:
print(df.dtypes)

ID          int64
Name       object
Age       float64
Gender     object
Salary    float64
dtype: object

In [ ]:
df.duplicated().sum()

np.int64(1)

In [ ]:
df.drop_duplicates(inplace=True)
print(df)

   ID    Name   Age  Gender   Salary
0   1   Sahil  28.0       M  30000.0
1   2   Priya  -3.0  Female  50000.0
3   3    Nita  45.0       f  40000.0
4   4   Rahul   NaN    male  60000.0
5   5  Gaurav  35.0    Male      NaN

In [ ]:
df['Age']=df['Age'].apply(lambda x:np.nan if x<0 else x)
print(df)

   ID    Name   Age  Gender   Salary
0   1   Sahil  28.0       M  30000.0
1   2   Priya   NaN  Female  50000.0
3   3    Nita  45.0       f  40000.0
4   4   Rahul   NaN    male  60000.0
5   5  Gaurav  35.0    Male      NaN

In [ ]:
df['Age']=df['Age'].fillna(df['Age'].mean())
print(df)

   ID    Name   Age  Gender   Salary
0   1   Sahil  28.0       M  30000.0
1   2   Priya  36.0  Female  50000.0
3   3    Nita  45.0       f  40000.0
4   4   Rahul  36.0    male  60000.0
5   5  Gaurav  35.0    Male      NaN

In [ ]:
df['Salary']=df['Salary'].fillna(df['Salary'].mean())
print(df)

   ID    Name   Age  Gender   Salary
0   1   Sahil  28.0       M  30000.0
1   2   Priya  36.0  Female  50000.0
3   3    Nita  45.0       f  40000.0
4   4   Rahul  36.0    male  60000.0
5   5  Gaurav  35.0    Male  45000.0

In [ ]:
df['Gender']=df['Gender'].replace({'Female':'F','Male':'M','f':'F','m':'M','male':'M'})
print(df)

   ID    Name   Age Gender   Salary
0   1   Sahil  28.0      M  30000.0
1   2   Priya  36.0      F  50000.0
3   3    Nita  45.0      F  40000.0
4   4   Rahul  36.0      M  60000.0
5   5  Gaurav  35.0      M  45000.0

In [ ]:
#scaling
from sklearn.preprocessing import MinMaxScaler

scalar=MinMaxScaler()
df['Age']=scalar.fit_transform(df[['Age']])
df['Salary']=scalar.fit_transform(df[['Salary']])
print(df)

   ID    Name       Age Gender    Salary
0   1   Sahil  0.000000      M  0.000000
1   2   Priya  0.470588      F  0.666667
3   3    Nita  1.000000      F  0.333333
4   4   Rahul  0.470588      M  1.000000
5   5  Gaurav  0.411765      M  0.500000

In [ ]:
df = pd.get_dummies(df, columns=['Gender'], prefix='Gender')

print("\nCleaned & Preprocessed Data:\n", df)

Cleaned & Preprocessed Data:
    ID    Name       Age    Salary  Gender_F  Gender_M
0   1   Sahil  0.000000  0.000000     False      True
1   2   Priya  0.470588  0.666667      True     False
3   3    Nita  1.000000  0.333333      True     False
4   4   Rahul  0.470588  1.000000     False      True
5   5  Gaurav  0.411765  0.500000     False      True